| scene       | class             |  TP |  FN | TP_rate | FP | FP_off |  TN | FP_rate |  dist |
|-------------+-------------------+-----+-----+---------+----+--------+-----+---------+-------|
| kitchen     | Lettuce           |  69 |   1 |   0.986 |  1 |      1 | 344 |   0.003 | 1.983 |
| kitchen     | Spoon             |   3 |  58 |   0.049 |  3 |      3 | 351 |   0.008 | 1.737 |
| kitchen     | Egg               |   9 |  11 |   0.450 |  4 |      4 | 391 |   0.010 | 1.338 |
| kitchen     | Faucet            |  37 |  29 |   0.561 | 28 |      4 | 321 |   0.080 | 2.161 |
| kitchen     | Fork              |   3 |  61 |   0.047 |  6 |      6 | 345 |   0.017 | 1.294 |
| kitchen     | DishSponge        |  39 |  24 |   0.619 | 11 |      8 | 341 |   0.031 | 1.624 |
| kitchen     | Sink              |  61 |  28 |   0.685 | 33 |      8 | 293 |   0.101 | 1.697 |
| kitchen     | Plate             |  60 |  39 |   0.606 | 10 |     10 | 306 |   0.032 | 1.901 |
| kitchen     | Floor             | 241 |  36 |   0.870 | 26 |     10 | 112 |   0.188 | 2.891 |
| kitchen     | LightSwitch       |  72 |   8 |   0.900 | 13 |     11 | 322 |   0.039 | 2.565 |
| kitchen     | StoveKnob         |  77 |  16 |   0.828 | 18 |     12 | 304 |   0.056 | 1.999 |
| kitchen     | StoveBurner       | 103 |  14 |   0.880 | 20 |     13 | 278 |   0.067 | 1.897 |
| kitchen     | Microwave         |  70 |  23 |   0.753 | 18 |     16 | 304 |   0.056 | 2.309 |
| kitchen     | Mug               |  34 |  39 |   0.466 | 17 |     17 | 325 |   0.050 | 1.691 |
| kitchen     | Bread             |  72 |  28 |   0.720 | 18 |     17 | 297 |   0.057 | 1.989 |
| kitchen     | Fridge            | 133 |  56 |   0.704 | 18 |     17 | 208 |   0.080 | 2.181 |
| kitchen     | GarbageCan        |  81 |  28 |   0.743 | 18 |     18 | 288 |   0.059 | 2.132 |
| kitchen     | SaltShaker        |  33 |  41 |   0.446 | 24 |     19 | 317 |   0.070 | 2.124 |
| kitchen     | SoapBottle        |  54 |  24 |   0.692 | 23 |     21 | 314 |   0.068 | 2.305 |
| kitchen     | Spatula           |  15 |  66 |   0.185 | 28 |     25 | 306 |   0.084 | 1.179 |
| kitchen     | Tomato            |  45 |  16 |   0.738 | 26 |     26 | 328 |   0.073 | 1.658 |
| kitchen     | Pan               |  39 |  29 |   0.574 | 29 |     26 | 318 |   0.084 | 2.316 |
| kitchen     | Potato            |  56 |   8 |   0.875 | 28 |     28 | 323 |   0.080 | 1.715 |
| kitchen     | PepperShaker      |  26 |  43 |   0.377 | 30 |     30 | 316 |   0.087 | 1.676 |
| kitchen     | CoffeeMachine     |  91 |  15 |   0.858 | 31 |     30 | 278 |   0.100 | 2.236 |
| kitchen     | Knife             |  24 |  39 |   0.381 | 33 |     31 | 319 |   0.094 | 1.427 |
| kitchen     | Cup               |  19 |  58 |   0.247 | 35 |     35 | 303 |   0.104 | 1.760 |
| kitchen     | Toaster           |  94 |  13 |   0.879 | 35 |     35 | 273 |   0.114 | 2.263 |
| kitchen     | Apple             |  29 |  20 |   0.592 | 40 |     40 | 326 |   0.109 | 1.783 |
| kitchen     | Bowl              |  40 |  26 |   0.606 | 40 |     40 | 309 |   0.115 | 1.750 |
| kitchen     | Pot               |  56 |  30 |   0.651 | 51 |     51 | 278 |   0.155 | 1.671 |
| kitchen     | Cabinet           | 171 |  40 |   0.810 | 65 |     52 | 139 |   0.319 | 2.215 |
| kitchen     | CounterTop        | 141 |  47 |   0.750 | 77 |     57 | 150 |   0.339 | 1.901 |
|-------------+-------------------+-----+-----+---------+----+--------+-----+---------+-------|
| living_room | Floor             | 266 |  34 |   0.887 | 19 |      1 |  96 |   0.165 | 2.904 |
| living_room | LightSwitch       |  58 |  14 |   0.806 |  5 |      2 | 338 |   0.015 | 3.096 |
| living_room | KeyChain          |  20 |  49 |   0.290 |  6 |      4 | 340 |   0.017 | 1.908 |
| living_room | Laptop            |  69 |  35 |   0.663 |  8 |      5 | 303 |   0.026 | 2.237 |
| living_room | HousePlant        |  92 |  19 |   0.829 | 12 |      6 | 292 |   0.039 | 3.000 |
| living_room | Pillow            |  64 |  31 |   0.674 |  9 |      9 | 311 |   0.028 | 2.843 |
| living_room | Painting          | 121 |  21 |   0.852 | 11 |      9 | 262 |   0.040 | 3.184 |
| living_room | FloorLamp         |  86 |  34 |   0.717 | 15 |      9 | 280 |   0.051 | 3.440 |
| living_room | Box               |  64 |  36 |   0.640 | 16 |     12 | 299 |   0.051 | 2.339 |
| living_room | GarbageCan        |  74 |  47 |   0.612 | 16 |     13 | 278 |   0.054 | 3.272 |
| living_room | RemoteControl     |  55 |  24 |   0.696 | 15 |     14 | 321 |   0.045 | 1.925 |
| living_room | CreditCard        |  27 |  36 |   0.429 | 15 |     15 | 337 |   0.043 | 1.476 |
| living_room | Television        |  93 |  16 |   0.853 | 16 |     16 | 290 |   0.052 | 2.590 |
| living_room | Sofa              | 119 |  52 |   0.696 | 25 |     20 | 219 |   0.102 | 3.071 |
|-------------+-------------------+-----+-----+---------+----+--------+-----+---------+-------|
| bedroom     | Mirror            | 104 |  17 |   0.860 |  2 |      2 | 323 |   0.006 | 2.272 |
| bedroom     | Window            | 149 |  21 |   0.876 | 23 |      2 | 253 |   0.083 | 2.398 |
| bedroom     | Laptop            |  88 |  28 |   0.759 |  4 |      4 | 326 |   0.012 | 2.186 |
| bedroom     | CreditCard        |  38 |  47 |   0.447 |  8 |      6 | 353 |   0.022 | 1.401 |
| bedroom     | DeskLamp          | 119 |  14 |   0.895 |  8 |      7 | 305 |   0.026 | 2.411 |
| bedroom     | Pen               |  13 |  63 |   0.171 | 20 |      8 | 350 |   0.054 | 1.572 |
| bedroom     | Bed               | 146 |  84 |   0.635 | 13 |      9 | 203 |   0.060 | 2.387 |
| bedroom     | LightSwitch       |  71 |  22 |   0.763 | 10 |     10 | 343 |   0.028 | 2.265 |
| bedroom     | GarbageCan        |  75 |  17 |   0.815 | 10 |     10 | 344 |   0.028 | 2.522 |
| bedroom     | Pencil            |  10 |  69 |   0.127 | 11 |     10 | 356 |   0.030 | 2.226 |
| bedroom     | KeyChain          |  18 |  63 |   0.222 | 15 |     11 | 350 |   0.041 | 1.274 |
| bedroom     | CellPhone         |  43 |  43 |   0.500 | 14 |     12 | 346 |   0.039 | 1.695 |
| bedroom     | Floor             | 272 |  33 |   0.892 | 34 |     12 | 107 |   0.241 | 2.131 |
| bedroom     | Book              |  62 |  37 |   0.626 | 17 |     15 | 330 |   0.049 | 2.046 |
| bedroom     | CD                |  34 |  36 |   0.486 | 17 |     16 | 359 |   0.045 | 1.695 |
| bedroom     | Pillow            |  91 |  12 |   0.883 | 18 |     16 | 325 |   0.052 | 2.428 |
| bedroom     | AlarmClock        |  74 |  19 |   0.796 | 26 |     24 | 327 |   0.074 | 2.767 |
|-------------+-------------------+-----+-----+---------+----+--------+-----+---------+-------|
| bathroom    | Plunger           |  34 |  33 |   0.507 |  9 |      1 | 343 |   0.026 | 1.946 |
| bathroom    | ToiletPaperHanger |  76 |  14 |   0.844 |  5 |      3 | 324 |   0.015 | 1.962 |
| bathroom    | ScrubBrush        |  25 |  60 |   0.294 |  8 |      4 | 326 |   0.024 | 1.805 |
| bathroom    | SoapBar           |  60 |  22 |   0.732 |  6 |      5 | 331 |   0.018 | 1.527 |
| bathroom    | Floor             | 174 | 104 |   0.626 | 15 |      5 | 126 |   0.106 | 2.688 |
| bathroom    | Towel             | 100 |  26 |   0.794 |  8 |      7 | 285 |   0.027 | 1.882 |
| bathroom    | Mirror            | 113 |  34 |   0.769 | 10 |      7 | 262 |   0.037 | 2.097 |
| bathroom    | Toilet            | 138 |  22 |   0.863 |  9 |      8 | 250 |   0.035 | 1.808 |
| bathroom    | Sink              | 133 |  25 |   0.842 | 12 |     10 | 249 |   0.046 | 1.713 |
| bathroom    | LightSwitch       |  79 |   7 |   0.919 | 14 |     12 | 319 |   0.042 | 1.810 |
| bathroom    | ToiletPaper       |  73 |   7 |   0.912 | 14 |     13 | 325 |   0.041 | 1.868 |
| bathroom    | HandTowel         |  83 |  12 |   0.874 | 15 |     13 | 309 |   0.046 | 2.137 |
| bathroom    | GarbageCan        | 104 |  33 |   0.759 | 16 |     15 | 266 |   0.057 | 1.920 |
| bathroom    | TowelHolder       |  61 |  18 |   0.772 | 42 |     15 | 298 |   0.124 | 2.019 |
| bathroom    | SoapBottle        |  85 |   8 |   0.914 | 21 |     18 | 305 |   0.064 | 1.874 |
| bathroom    | Cloth             |  66 |   3 |   0.957 | 21 |     19 | 329 |   0.060 | 1.569 |
| bathroom    | Faucet            | 122 |  13 |   0.904 | 39 |     22 | 245 |   0.137 | 1.936 |
| bathroom    | SprayBottle       |  51 |  18 |   0.739 | 24 |     23 | 326 |   0.069 | 2.118 |
| bathroom    | Candle            |  54 |  30 |   0.643 | 33 |     31 | 302 |   0.099 | 1.707 |
#+TBLFM: $5=$5;%0.3f
#+TBLFM: $9=$9;%0.3f
#+TBLFM: $10=$10;%0.3f
